Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/exceptional_needs_payments.html.txt.tmx
Source language: en
Languages: ga

source: Exceptional Needs Payments are paid under the Supplementary Welfare Allowance Scheme
ga: Is íocaíochtaí iad Íocaíocht ar Riachtanais Eisceachtúil agus Íocaíocht ar Riachtanais Phráinneach faoin scéim Liúntas Leasa Forlíontach

source: An Exceptional Needs Payment is a single payment to help meet essential, once-off, exceptional expenditure, which a person could not reasonably be expected to meet out of their weekly income
ga: Is íocaíocht shingil í Íocaíocht ar Riachtanais Eisceachtúil chun cabhrú le caiteachas riachtanach aon uair ar chúinsí faoi leith, nach bhféadfaidh duine a ghlanadh ón ioncam seachtainiúil

source: For example, the payments can be for special clothing for a person who has a serious illness, bedding or cooking utensils for someone setting up a home for the first time, visiting relatives in hospital or prison, or funeral costs
ga: Mar shampla, d’fhéadfaí íocaíochtaí a dhéanamh le haghaidh éadaí speisialta do dhuine ar a mbeadh galar trom, nó le haghaidh leapacha nó gréithe cócaireachta do dhuine atá ag dul i mbun a thí féin den chéad uair, ag tabhairt cuairte ar ghaolta atá san ospidéal nó i bpríosún, nó le haghaidh costas sochraide

source: You can also apply for financial help for clothing for children
ga: Ní íoctar Riachtanais Eisceachtúla Íocaíochtaí a thuilleadh le haghaidh searmanais creidimh, go formhór comaoineacha agus cóineartaithe

source: Exceptional Needs Payments are no longer paid for religious ceremonies, mainly communions and confirmations
ga: Is féidir lean ar iarratais chun cabhair airgeadais le haghaidh éadaí do leanaí a fháil

source: Help with funeral costs
ga: Cúnamh le costaisí sochraide

source: You may be eligible for an Exceptional Needs Payment to help you with the cost of a funeral if your income is low
ga: D'fhéadfá a bheith i dteideal Íocaíocht ar Riachtanais Eisceachtúil chun cabhrú leat le costaisí na sochraide má tá tú ar mhaoin íseal

source: Each case is decided on its merits by the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local office
ga: Déantar cinneadh ar gach cás ag brath ar na cúinsí ar leith a bhaineann leis, agus is é/í an Roinn Coimirce Sóisialaí ionadaí (tugadh an tOifigeach Leasa Pobail orthu roimhe seo) ag do ionad sláinte áitiúil a dhéanann an cinneadh

source: Help with fuel bills
ga: Cúnamh le billí breosla

source: You may get help with the cost of your electricity or natural gas bill but only in exceptional circumstances
ga: Déanfaidhan an Roinn Coimirce Sóisialaí ionadaí cinneadh ar do chás trí úsáid a bhaint as an gCód Cleachtais ar Fhiacha Breosla

source: What should I do if I have difficulties paying my energy bills?
ga: Íocaíochtaí ar Riachtanais Phráinneach

source: The Department of Social Protection has published information to help you if you are in financial difficulty with your energy bills
ga: D'fhéadfaí Íocaíocht ar Riachtanais Phráinneach a bheith íoctha le daoine i gcásanna éigeandála

source: You may be eligible for an Exceptional Needs Payment if:
ga: Íocaíocht ar Riachtanais Eisceachtúil

source: • You are living in the State
ga: • Tá tú i do chónaí sa stáit

source: • You satisfy a means test
ga: • Éiríonn leat i scrúdú maoine

source: You won't normally be eligible if you are:
ga: Go hiondúil ní bheith tú ina theideal má tá tú:

source: • In full-time work (more than 30 hours a week)
ga: • Ag obair go lán-aimsearthach (níos mó ná 30 uair sa tseachtain)

source: • Involved in a trade dispute or on strike
ga: • A glacadh páirt in aighneas trádála

source: However, you may apply for an Exceptional Needs Payment for your dependent adult or dependent child
ga: Is féidir leat, áfach, iarratas a chur isteach ar Liúntas Leasa Forlíontach ar son do chleithiúnaigh

source: The amount of payment you get will depend on a means test and the type of assistance you need
ga: Tá an méid cabhrach a bhfaighfidh tú le costaisí sochraide ag brath ar scrúdú maoine

source: You should apply for funeral assistance before the funeral takes place, however, failing this, you should apply as soon as possible afterwards
ga: Moltar go ndéanfá iarratas ar chabhair sochraide roimh an sochraid, ach muna néiríonn leat é seo a dhéanamh, ba cheart duit an tiarratas a dhéanamh chomh luath agus is féidir leat taréis na sochraide

source: To apply for an Exceptional Needs Payment payment you will need:
ga: Chun cur isteach ar íocaíocht géarghá beidh gá agat le:

source: • Personal Public Service (PPS) numbers for yourself, your spouse, civil partner or cohabitant and your children
ga: • Uimhir Pearsanta Seirbhís Poiblí (PSP) duit féin, do chéile/páirtnéir sibhialta/comhchónaitheoir agus do pháistí

source: • Evidence of any income or social welfare assistance you are getting
ga: • Cruthúnas de aon ioncam nó cúnamh leasa shóisialaigh atá tú ag fáil

source: You cannot appeal a decision on an Exceptional Needs Payment to the Social Welfare Appeals Office
ga: Níl aon chóras ann le hachomharc Íocaíocht ar Riachtanais Eisceachtúil nó Íocaíocht ar Riachtanais Phráinneach a dhéanamh chuig an Oifig Achomharc Leasa Shóisialaigh

source: However, you may request that a decision be reviewed by the SWA Review Officer for the office which made the original decision
ga: Ach is féidir leat iarraidh go ndéanfaidh an tOifigeach Breithiúnachta LLF, a bhaineann leis an oifig a rinne an bunchinneadh, athbhreithniú an cinneadh

source: You should contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local office
ga: Ba cheart duit teagmháil a dhéanamh le hionadaí na Roinne Coimirce Sóisialaí (tugadh an tOifigeach Leasa Pobail orthu roimhe seo) ag d'oifig sláinte áitiúil
